load-test-final.txt
Running 1m test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   192.63ms   87.87ms   1.99s    83.60%
    Req/Sec   132.43     39.75   252.00     69.25%
  31674 requests in 1.00m, 65.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:    527.14
Transfer/sec:      1.08MB
